MiBusCR/app/controllers/eventos_controller.rb

  def index
    @eventos = Evento.all
---
SELECT "eventos".* FROM "eventos"

    def set_ruta
      begin
        @evento = Evento.find(params[:id])
---
SELECT  "eventos".* FROM "eventos"  WHERE "eventos"."id" = ? LIMIT 1  [["id", 1]]