MiBusCR/app/controllers/rutas_controller.rb

    def set_ruta
      begin
        @ruta = Ruta.find(params[:id])
---
SELECT  "rutas".* FROM "rutas"  WHERE "rutas"."id" = ? LIMIT 1  [["id", 1]]