MiBusCR/app/controllers/ruta_users_controller.rb

  def create
    if params[:ruta_id] != ""
      @ruta_user = @current_user.ruta_user.find_by(ruta_id: params[:ruta_id])
---
SELECT  "rutas".* FROM "rutas" INNER JOIN "ruta_users" ON "rutas"."id" = "ruta_users"."ruta_id" WHERE "ruta_users"."user_id" = ? AND "rutas"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]