MiBusCR/app/controllers/ruta_users_controller.rb

  def index
    @ruta_users = RutaUser.all
---
SELECT "ruta_users".* FROM "ruta_users"  WHERE "ruta_users"."user_id" = ?  [["user_id", 1]]

  def create
    #@rutas_usuario = RutasUsuario.new(rutas_usuario_params)
    if current_user != nil
      respond_to do |format|
        if params[:ruta_favorita] != ""
          @ruta = Ruta.find(params[:ruta_favorita])
          @user = current_user
          @rutas_usuario = RutasUsuario.new(ruta:@ruta, user:@user)
        end
        if @rutas_usuario.save
---
SELECT  "rutas".* FROM "rutas"  WHERE "rutas"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "ruta_users" ("created_at", "ruta_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", "2014-10-05 06:08:11.240500"], ["ruta_id", 1], ["updated_at", "2014-10-05 06:08:11.240500"], ["user_id", 1]]

  def destroy
    @ruta_user.destroy
---
DELETE FROM "ruta_users" WHERE "ruta_users"."id" = ?  [["id", 2]]

    def set_ruta_user
      @ruta_user = RutaUser.find(params[:id])
---
SELECT  "ruta_users".* FROM "ruta_users"  WHERE "ruta_users"."user_id" = ? AND "ruta_users"."ruta_id" = 2 LIMIT 1  [["user_id", 1]]